app/controllers/ledgers_controller.rb

  def index
    @ledgers = Ledger.all
---
SELECT "ledgers".* FROM "ledgers"

  def create
    @ledger = Ledger.new(ledger_params)

    if @ledger.save
---
INSERT INTO "ledgers" ("user_id", "community_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["community_id", 4], ["created_at", "2018-01-15 22:13:40.850532"], ["updated_at", "2018-01-15 22:13:40.850532"]]