app/controllers/posts_controller.rb

  def index
    @posts = Post.where(community_id: params[:community_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = $1  [["community_id", 1]]